brew "bat"
brew "block-goose-cli"
brew "difftastic"
brew "node"
brew "fd"
brew "fish"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "htop"
brew "jj"
brew "llm"
brew "lnav"
brew "lsd"
brew "mise"
brew "neovim"
brew "pass"
brew "repomix"
brew "ripgrep"
brew "sad"
brew "starship"
brew "stow"
brew "viddy"
brew "zellij"

cask "font-hack-nerd-font"
cask "wezterm"
